evidence/OPS-2202/before/k6-console.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/reproduce-OPS-2202.js
        output: -

     scenarios: (100.00%) 1 scenario, 2000 max VUs, 35s max duration (incl. graceful stop):
              * registration_surge: Up to 2000 looping VUs for 30s over 2 stages (gracefulRampDown: 30s, gracefulStop: 5s)


running (00.9s), 0355/2000 VUs, 632 complete and 0 interrupted iterations
registration_surge   [   3% ] 0355/2000 VUs  00.9s/30.0s

running (01.9s), 0755/2000 VUs, 1672 complete and 0 interrupted iterations
registration_surge   [   6% ] 0755/2000 VUs  01.9s/30.0s

running (02.9s), 1155/2000 VUs, 2934 complete and 0 interrupted iterations
registration_surge   [  10% ] 1155/2000 VUs  02.9s/30.0s

running (03.9s), 1555/2000 VUs, 4365 complete and 0 interrupted iterations
registration_surge   [  13% ] 1555/2000 VUs  03.9s/30.0s

running (04.9s), 1955/2000 VUs, 5864 complete and 0 interrupted iterations
registration_surge   [  16% ] 1955/2000 VUs  04.9s/30.0s

running (05.9s), 2000/2000 VUs, 6426 complete and 0 interrupted iterations
registration_surge   [  20% ] 2000/2000 VUs  05.9s/30.0s

running (06.9s), 2000/2000 VUs, 7204 complete and 0 interrupted iterations
registration_surge   [  23% ] 2000/2000 VUs  06.9s/30.0s

running (07.9s), 2000/2000 VUs, 7755 complete and 0 interrupted iterations
registration_surge   [  26% ] 2000/2000 VUs  07.9s/30.0s

running (08.9s), 2000/2000 VUs, 7873 complete and 0 interrupted iterations
registration_surge   [  30% ] 2000/2000 VUs  08.9s/30.0s

running (09.9s), 2000/2000 VUs, 8618 complete and 0 interrupted iterations
registration_surge   [  33% ] 2000/2000 VUs  09.9s/30.0s

running (10.9s), 2000/2000 VUs, 9675 complete and 0 interrupted iterations
registration_surge   [  36% ] 2000/2000 VUs  10.9s/30.0s

running (11.9s), 2000/2000 VUs, 10926 complete and 0 interrupted iterations
registration_surge   [  40% ] 2000/2000 VUs  11.9s/30.0s

running (12.9s), 2000/2000 VUs, 12114 complete and 0 interrupted iterations
registration_surge   [  43% ] 2000/2000 VUs  12.9s/30.0s

running (13.9s), 2000/2000 VUs, 13569 complete and 0 interrupted iterations
registration_surge   [  46% ] 2000/2000 VUs  13.9s/30.0s

running (14.9s), 2000/2000 VUs, 15169 complete and 0 interrupted iterations
registration_surge   [  50% ] 2000/2000 VUs  14.9s/30.0s

running (15.9s), 2000/2000 VUs, 16788 complete and 0 interrupted iterations
registration_surge   [  53% ] 2000/2000 VUs  15.9s/30.0s

running (16.9s), 2000/2000 VUs, 18337 complete and 0 interrupted iterations
registration_surge   [  56% ] 2000/2000 VUs  16.9s/30.0s

running (17.9s), 2000/2000 VUs, 20047 complete and 0 interrupted iterations
registration_surge   [  60% ] 2000/2000 VUs  17.9s/30.0s

running (18.9s), 2000/2000 VUs, 21564 complete and 0 interrupted iterations
registration_surge   [  63% ] 2000/2000 VUs  18.9s/30.0s

running (19.9s), 2000/2000 VUs, 23113 complete and 0 interrupted iterations
registration_surge   [  66% ] 2000/2000 VUs  19.9s/30.0s

running (20.9s), 2000/2000 VUs, 24869 complete and 0 interrupted iterations
registration_surge   [  70% ] 2000/2000 VUs  20.9s/30.0s

running (21.9s), 2000/2000 VUs, 26557 complete and 0 interrupted iterations
registration_surge   [  73% ] 2000/2000 VUs  21.9s/30.0s

running (22.9s), 2000/2000 VUs, 28306 complete and 0 interrupted iterations
registration_surge   [  76% ] 2000/2000 VUs  22.9s/30.0s

running (23.9s), 2000/2000 VUs, 29928 complete and 0 interrupted iterations
registration_surge   [  80% ] 2000/2000 VUs  23.9s/30.0s

running (24.9s), 2000/2000 VUs, 31532 complete and 0 interrupted iterations
registration_surge   [  83% ] 2000/2000 VUs  24.9s/30.0s

running (25.9s), 2000/2000 VUs, 33078 complete and 0 interrupted iterations
registration_surge   [  86% ] 2000/2000 VUs  25.9s/30.0s

running (26.9s), 2000/2000 VUs, 34709 complete and 0 interrupted iterations
registration_surge   [  90% ] 2000/2000 VUs  26.9s/30.0s

running (27.9s), 2000/2000 VUs, 36341 complete and 0 interrupted iterations
registration_surge   [  93% ] 2000/2000 VUs  27.9s/30.0s

running (28.9s), 2000/2000 VUs, 38023 complete and 0 interrupted iterations
registration_surge   [  96% ] 2000/2000 VUs  28.9s/30.0s

running (29.9s), 2000/2000 VUs, 39320 complete and 0 interrupted iterations
registration_surge   [ 100% ] 2000/2000 VUs  29.9s/30.0s

running (30.9s), 0403/2000 VUs, 41072 complete and 0 interrupted iterations
registration_surge ↓ [ 100% ] 2000/2000 VUs  30s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 41475   1334.182149/s
    checks_succeeded...: 100.00% 41475 out of 41475
    checks_failed......: 0.00%   0 out of 41475

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=1.35s min=23.31ms med=1.23s max=4.38s p(90)=1.77s p(95)=3.02s
      { expected_response:true }...: avg=1.35s min=23.31ms med=1.23s max=4.38s p(90)=1.77s p(95)=3.02s
    http_req_failed................: 0.00%  0 out of 41475
    http_reqs......................: 41475  1334.182149/s

    EXECUTION
    iteration_duration.............: avg=1.35s min=23.5ms  med=1.23s max=4.38s p(90)=1.77s p(95)=3.02s
    iterations.....................: 41475  1334.182149/s
    vus............................: 398    min=356        max=2000
    vus_max........................: 2000   min=2000       max=2000

    NETWORK
    data_received..................: 763 MB 25 MB/s
    data_sent......................: 3.7 MB 119 kB/s



running (31.1s), 0000/2000 VUs, 41475 complete and 0 interrupted iterations
registration_surge ✓ [ 100% ] 0000/2000 VUs  30s